import beroimg from "../images/berolectore.png"
import cardimg from "../images/cardimg.png"

export interface SyllabusItem {
  title: string;
  topics: string[];
}

export interface Course {
  id: number;
  tag: string;
  hours: string;
  title: string; // <--- ეს დავამატეთ (titleKey-ს ნაცვლად ან პარალელურად)
  subtitle?: string; // <--- ესეც დავამატეთ
  description: string; // <--- descKey-ს ნაცვლად
  fullDescription: React.ReactNode; // <--- ესეც დავამატეთ, რადგან JSX-ს აბრუნებ
  borderColor: string;
  shadowColor: string;
  circleColor: string;
  tagBg: string;
  isDisabled: boolean;
  features?: string[]; // <--- ეს SecondSection-ისთვის
  image?: string; // <--- ესეც SecondSection-ისთვის
  price?: string; // <--- ესეც
  bonus?: string; // <--- ესეც
  startDate?: string;
  schedule?: string;
  location?: string;
  descKey?: string;
  mapLink?: string;
  lectore?: string;
  oldPrice?: string;
  time?: string;
  syllabus?: SyllabusItem[];
  coverImage?: string
  
}

export const coursesData: Course[] = [
  {
    id: 1,
    tag: "საფონდო ბირჟაზე ინვესტიცია",
    tagBg: "bg-green-100 text-green-700",
    hours: "16 საათი",
    title: "ინვესტიცია საფონდო ბირჟაზე",
    subtitle: "გამოიმუშავე ფული, მაშინ როცა გძინავს",
    lectore: "გიორგი ბერუაშვილი",
    startDate: "2 მარტი",
    schedule: "ორშაბათი/ხუთშაბათი",
    image: beroimg,
    location: "Holiday Inn",
    mapLink: "https://maps.app.goo.gl/VY6GcJFxcS6z63AYA",
    description:
      "კურსის მიზანია სტუდენტებს მისცეს ამომწურავი ინფორმაცია საფონდო ბირჟის ფუნქციონირების და საინვესტიციო სტრატეგიების შესახებ.",
    fullDescription: `კურსის მიზანია სტუდენტებს მისცეს ამომწურავი ინფორმაცია საფონდო ბირჟის ფუნქციონირების, მასში მონაწილე სუბიექტებისა და საინვესტიციო სტრატეგიების შესახებ.

კურსი მაქსიმალურად არის მორგებული პრაქტიკულ მუშაობაზე. კურსის დასრულების შემდეგ კურსდამთავრებულებს ინდივიდუალურად შეეძლებათ:

• დაისახონ საკუთარ მიზნებზე მორგებული საინვესტიციო სტრატეგია
• შექმნან საკუთარ სტრატეგიაზე მორგებული პორტფელი
• შეარჩიონ საინვესტიციოდ მომგებიანი კომპანიები საკუთარი პორფელისთვის
• დანერგონ რისკ-მენეჯმენტის სტრატეგიები
• შეიძინონ კომპანიების აქციები ინდივიდუალურად

კურსის დასრულების შემდეგ კურსდამთავრებულები გაწევრიანდებიან დახურულ ჩატში, რომელიც ფუნქციონირებს „საინვესტიციო საბჭოს“ პრინციპით. ამ პლატფორმაზე წვდომა მოგცემთ საშუალებას:

• მიიღოთ Lifetime მხარდაჭერა ლექტორისგან
• გაცვალოთ აზრები და მიიღოთ რეკომენდაციები სფეროს სპეციალისტებისგან და საკუთარი ჯგუფელებისგან.
• ერთად განიხილოთ ბაზრის ტენდენციები
• გაანალიზოთ კომპანიების ფინანსური შედეგები

კურსდამთავრებულებს გადაეცემათ ორენოვანი სერთიფიკატი!`,
    descKey: "investment_desc",
    borderColor: "hover:border-[#00CC87]",
    shadowColor: "hover:shadow-[8px_8px_0px_#00CC87]",
    circleColor: "bg-[#00CC87]",
    isDisabled: false,
    coverImage: cardimg,
    time: "19:00",
    price: "499 ₾",
    oldPrice: "625 ₾",
    features: [
      "გლობალური ბაზრები",
      "აქციების შეფასება",
      "ფინანსური ანალიზი",
      "პრაქტიკული ვაჭრობა",
    ],
    bonus: "Life-time მხარდაჭერა",

    // --- ახალი ნაწილი: სილაბუსი ---
    syllabus: [
      {
        title: "ლექცია 1 - როგორ გამოვიმუშავოთ ფული, როცა გვძინავს",
        topics: [
          "რა არის ინვესტირება? ინვესტირების ტიპები",
          "ინფლაცია და მსოფლიოს მერვე საოცრებად წოდებული - რთული პროცენტი",
          "მომავალი ფულადი ნაკადების ანალიზი",
          "განსხვავება ინვესტორსა და ტრეიდერს შორის",
          "რას ვსწავლობთ, რატომ ვსწავლობთ, და რას შევძლებთ კურსის ბოლოს?",
        ],
      },
      {
        title: "ლექცია 2 - ფინანსები და ეკონომიკა",
        topics: [
          "აქციის ღირებულების განსაზღვრა",
          "მოთხოვნისა და მიწოდების მრუდების ანალიზი",
          "მაკროეკონომიკის გავლენა აქციის ფასებზე (ინფლაცია, უმუშევრობა, მშპ)",
          "ფული როგორც პროდუქტი",
          "ფინანსური ანგარიშგებების განხილვა ( ბალანსი, მოგება-ზარალის უწყისი )",
        ],
      },
      {
        title: "ლექცია 3 - როგორ წავიკითხოთ აქციის ფუნდამენტი",
        topics: [
          "რა არის IPO და რატომ ყიდიან დამფუძნებლები საკუთარ წილს კომპანიაში?",
          "აქციის ფასი და საბაზრო კაპიტალიზაცია (კორელაცია და პარადოქსები)",
          "რა არის საფონდო ბირჟა? რატომ ილისტება კომპანია რამდენიმე ბირჟაზე?",
          "პლატფორმა - Yahoo Finance - განხილვა და გამოყენება პრაქტიკაში",
          "ცვლადები, რომლებიც გვიყვება კომპანიის ისტორიას",
        ],
      },
      {
        title: "ლექცია 4 - აქციის ტიპები და როგორ ფუნქციონირებენ ისინი",
        topics: [
          "კომპანიების ტიპები (GIGS-ის კლასიფიკაცია)",
          "აქციების გახლეჩვა და გამოსყიდვის პოლიტიკა",
          "ინდექსები და ETF-ები, როგორ გამოვიყენოთ პრაქტიკაში",
          "რა არის Hedge Fund და Mutual Fund, მსგავსებები და განსხვავებები",
          "შიშისა და სიხარბის ინდექსის გამოყენება პრაქტიკაში",
        ],
      },
      {
        title: "ლექცია 5 - სრული ფუნდამენტალური ანალიზის ჩატარება პრაქტიკაში",
        topics: [
          "პლატფორმა - Simply Wall Street - განხილვა და გამოყენება პრაქტიკაში",
          "როგორ გავაანალიზოთ კომპანიის რეალური ღირებულება",
          "როგორ გავაანალიზოთ კომპანიის მომავალი პოტენციალი",
          "როგორ გავაანალიზოთ კომპანიის წარსულის პერფორმანსი",
          "როგორ გავაანალიზოთ კომპანიის ფინანსური სიჯანსაღე",
          "როგორ გავაანალიზოთ კომპანიის დივიდენდური პოლიტიკა",
          "როგორ გავაანალიზოთ კომპანიის მენეჯმენტი",
          "როგორ გავაანალიზოთ კომპანიის მფობელები",
        ],
      },
      {
        title: "ლექცია 6 - პორტფოლიოს სტრატეგიის დაგეგმვა და რისკ მენეჯმენტი",
        topics: [
          "საკუთარი სტრატეგიის შემუშავება და მიზნებზე მორგება",
          "დივერსიფიკაციის მნიშვნელობა პოტფელის შედგენისას",
          "ინვესტირების ხუთი ძირითადი სტრატეგია",
          "პლატფორმა - TradingView - განხილვა და გამოყენება პრაქტიკაში",
          "აქციის საბაზისო ტექნიკური გაანალიზება",
          "საბოლოო პროექტის მომზადებისთვის კომპანიების არჩევა",
        ],
      },
      {
        title: "ლექცია 7 - როგორ ვიყიდოთ პირველი აქცია",
        topics: [
          "განსხვავება აქციის რეალურ და საბაზრო ღირებულებას შორის",
          "როგორ მოვიძიოთ საინვესტიციოდ საინტერესო კომპანიები",
          "რა ხელსაწყოებს იყენებენ ინვესტორები ინვესტირების პროცესში",
          "რეგისტრაცია საფონდო ბირჟაზე",
          "როგორ შევიძინოთ ჩვენს მიერ შერჩეული აქცია პრაქტიკაში",
        ],
      },
      {
        title: "ლექცია 8 - პროექტების პრეზენტაცია და დაჯილდოება",
        topics: [
          "პროექტების ინდივიდუალური წარდგენა",
          "შესწავლილი მასალის შეჯამება",
          "Q/A დისკუსია",
          "გაწევრიანება „საინვესტიციო საბჭოში“",
          "დაჯილდოვება",
        ],
      },
    ],
  },
  {
    id: 2,
    tag: "სოციალური მედია ბიზნესისთვის",
    hours: "~200 hours",
    title: "სოციალური მედია ბიზნესისთვის",
    description: "თანამედროვე ვებ ინტერფეისები",
    fullDescription: "სოციალური მედია ბიზნესისთვის...",
    borderColor: "hover:border-[#61DAFB]",
    shadowColor: "hover:shadow-[8px_8px_0px_#61DAFB]",
    circleColor: "bg-[#61DAFB]",
    tagBg: "bg-blue-100 text-blue-700",
    isDisabled: true,
    image: "https://via.placeholder.com/300",
    price: "499 ₾",
    oldPrice: "625 ₾",
    features: ["Components", "Hooks", "Redux"],
    bonus: "პორტფოლიო",
  },
  {
    id: 3,
    tag: "ემოციური ინტელექტი",
    hours: "~35 hours",
    title: "ემოციური ინტელექტი",

    description: "თანამედროვე ვებ ინტერფეისები",
    fullDescription: "ემოციური ინტელექტი",
    borderColor: "hover:border-[#61DAFB]",
    shadowColor: "hover:shadow-[8px_8px_0px_#61DAFB]",
    circleColor: "bg-[#61DAFB]",
    tagBg: "bg-blue-100 text-blue-700",
    isDisabled: true,
    image: "https://via.placeholder.com/300",
    price: "600 ₾",
    features: ["Components", "Hooks", "Redux"],
    bonus: "პორტფოლიო",
  }

  // ... სხვა კურსები
];
